/*-------------------------------------------------------------------------------------
Copyright (C) 2010-2020 ShenZhen EasyMotion Technology Company

  Author: Amie
-------------------------------------------------------------------------------------*/
#ifndef __MOTION_API_H
#define __MOTION_API_H

#ifdef __cplusplus
extern "C" {
#endif

#define SUPPORT_SPI
#define SUPPORT_SAFE

typedef signed int      _INT;
typedef signed int      _LONG;
typedef double          _DOUBLE;
typedef unsigned short  _WORD;
typedef unsigned int    _DWORD;
typedef void            _VOID;
typedef unsigned char   _BOOL;
typedef char            _CHAR;
typedef unsigned char   _UCHAR;

#define MOTION_API      __declspec(dllexport)
#define MOTION_CDECL    __cdecl

/********************************************************************************
 *******************************    板级初始化    *******************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_board_init
 功能描述: 控制板初始化
 输　  入: 无
 返 回 值: 0：无卡； 1-16：实际卡数,最大支持16张卡
*********************************************************************************/
MOTION_API _WORD MOTION_CDECL motion_board_init(_VOID);

/********************************************************************************
 函数名称: motion_board_init_serial
 功能描述: 控制板初始化(串口)
 输　  入: 无
 返 回 值: 0：无卡； 1：实际卡数,最大支持1张卡
*********************************************************************************/
MOTION_API _WORD MOTION_CDECL motion_board_init_serial(_CHAR *pcCOM);

/********************************************************************************
 函数名称: motion_board_close
 功能描述: 关闭所有卡
 输　  入: 无
 返 回 值: 无
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_board_close(_VOID);

/********************************************************************************
 函数名称: motion_get_card_type
 功能描述: 查询卡类型
 输　  入: cardno: 卡号0-15
 返 回 值: 0xFF:无效卡类型, 1:B6612, 2:S8250, 3:B6308, 4:S8440, 5:B6428, 6:M9550, 其它值保留
*********************************************************************************/
MOTION_API _UCHAR MOTION_CDECL motion_get_card_type(_WORD cardno);


/********************************************************************************
 ********************************    脉冲输出    ********************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_set_pulse_outmode
 功能描述: 脉冲输出方式的设置
 输　  入: axis     轴号
           outmode  0 - 5
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_pulse_outmode(_WORD axis, _WORD outmode);


/********************************************************************************
 *******************************    专用IO配置    *******************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_config_EMG_PIN
 功能描述: 配置急停信号输入
 输　  入: cardno    卡号
           enable    0无效,1有效
           emg_logic 0低有效,1高有效
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_EMG_PIN(_WORD cardno, _WORD enable, _WORD emg_logic);

/********************************************************************************
 函数名称: motion_config_SD_PIN
 功能描述: 配置减速信号输入
 功能描述: 配置减速信号输入.暂时不支持该功能
 输　  入: axis     轴号
           enable   0无效,1有效, 暂不支持使能
           sd_logic 0-低电平有效,1-高电平有效
           sd_mode  0-减速到起始速度,如果SD信号丢失,又开始加速
                    1-减速到起始速度,并停止,如果在减速过程中,SD信号丢失,又开始加速
                    2-锁存SD信号,并减速到起始速度
                    3-锁存SD信号,并减速到起始速度后停止
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_SD_PIN(_WORD axis, _WORD enable, _WORD sd_logic, _WORD sd_mode);

/********************************************************************************
 函数名称: motion_config_PCS_PIN
 功能描述: 配置运动中变速信号输入
 输　  入: axis   轴号
           enable 0无效,1有效, 暂不支持使能
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_PCS_PIN(_WORD axis, _WORD enable, _WORD pcs_logic);

/********************************************************************************
 函数名称: motion_config_INP_PIN
 功能描述: 配置伺服到位信号输入
 输　  入: axis      轴号
           enable    0无效,1有效
           inp_logic 0低有效,1高有效
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_INP_PIN(_WORD axis, _WORD enable, _WORD inp_logic);

/********************************************************************************
 函数名称: motion_config_ERC_PIN
 功能描述: 配置误差清除信号输入.暂时不支持该功能
 输　  入: axis    轴号
           enable  0无效,1有效
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_ERC_PIN(_WORD axis, _WORD enable, _WORD erc_logic,
                                                _WORD erc_width, _WORD erc_off_time);
/********************************************************************************
 函数名称: motion_config_ALM_PIN
 功能描述: 配置伺服告警信号输入.暂时不支持该功能
 输　  入: 暂不支持
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_ALM_PIN(_WORD axis, _WORD alm_logic, _WORD alm_action);

/********************************************************************************
 函数名称: motion_config_EL_MODE
 功能描述: 配置限位信号工作模式
 输　  入: axis    轴号
           el_mode 0-立即停,低有效
                   1-减速停,低有效
                   2-立即停,高有效
                   3-减速停,高有效
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_EL_MODE(_WORD axis, _WORD el_mode);

/********************************************************************************
 函数名称: motion_config_EZ_PIN
 功能描述: 配置编码器EZ信号输入.暂时不支持该功能
 输　  入: axis     轴号 
           ez_logic EZ信号逻辑电平：0－低有效，1－高有效 
           ez_mode  EZ信号的工作方式： 
                        0－EZ信号无效 
                        1－EZ是计数器复位信号  
                        2－EZ是原点信号，且不复位计数器  
                        3－EZ是原点信号，且复位计数器
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_EZ_PIN(_WORD axis, _WORD ez_logic, _WORD ez_mode);

/********************************************************************************
 函数名称: motion_config_LTC_PIN
 功能描述: 配置锁存信号输入.暂时不支持该功能
 输　  入: axis      轴号
           ltc_logic 0-低有效,1-高有效
           ltc_mode  保留，可设为任意值
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_LTC_PIN(_WORD axis, _WORD ltc_logic, _WORD ltc_mode);

/********************************************************************************
 函数名称: motion_config_CMP_PIN
 功能描述: 配置位置比较输出端口的功能，每轴只有一个比较输出端口CMP
 输　  入: axis         轴号
           cmp1_enable  配置CMPn(n对应轴号)
                        0:配置为通用数字输出端口
                        1:配置为位置比较输出端口
           cmp2_enable  保留
           CMP_logic    位置比较输出电平,0:低电平；1:高电平
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_CMP_PIN(_WORD axis, _WORD cmp1_enable, _WORD cmp2_enable, _WORD CMP_logic);

/********************************************************************************
 函数名称: motion_read_CMP_PIN
 功能描述: 读取指定轴的比较输出端口的电平
 输　  入: axis     轴号
 返 回 值: 0-低电平, 1-高电平, -1-无效值,该板卡不支持CMP
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_read_CMP_PIN(_WORD axis);

/********************************************************************************
 函数名称: motion_write_CMP_PIN
 功能描述: 设置指定轴的位置比较输出端口的电平
 输　  入: axis     轴号
           on_off   0-低电平, 1-高电平
 返 回 值: 无
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_write_CMP_PIN(_WORD axis, _WORD on_off);

/********************************************************************************
 函数名称: motion_config_comparator
 功能描述: 配置指定轴比较器的触发条件
 输　  入: axis     轴号
           cmp1_condition  比较器1的触发条件 
                0：关闭比较器1功能 
                1：计数器的值等于比较器1 
                2：计数器的值小于比较器1 
                3：计数器的值大于比较器1
           cmp2_condition  保留
           source_sel    配置计数器类型 
                0：比较器与指令脉冲计数器比较 
                1：比较器与编码器脉冲比较 
           SL_action   0：保留
 返 回 值: 无
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_comparator(_WORD axis, _WORD cmp1_condition, _WORD cmp2_condition, _WORD source_sel, _WORD SL_action);

/********************************************************************************
 函数名称: motion_set_comparator_data
 功能描述: 预置比较器数值
 输　  入: axis       轴号
           cmp1_data  比较器1的值 
           cmp2_data  保留
 返 回 值: 无
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_comparator_data(_WORD axis, _LONG cmp1_data, _LONG cmp2_data);

/********************************************************************************
 函数名称: motion_set_HOME_pin_logic
 功能描述: 配置原点信号
 输　  入: axis      轴号
           org_logic 0-低有效,1-高有效
           filter    滤波功能0-禁止,1-允许
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_HOME_pin_logic(_WORD axis, _WORD org_logic, _WORD filter);

/********************************************************************************
 函数名称: motion_write_SEVON_PIN
 功能描述: 设置指定轴的伺服使能端口的电平
 输　  入: axis    轴号
           on_off  0-低,1-高
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_write_SEVON_PIN(_WORD axis, _WORD on_off);

/********************************************************************************
 函数名称: motion_read_SEVON_PIN
 功能描述: 读取指定轴的伺服使能端口的电平
 输　  入: axis     轴号
 返 回 值: 0-低电平, 1-高电平, -1-无效值,该板卡不支持SEVON
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_read_SEVON_PIN(_WORD axis);

/********************************************************************************
 函数名称: motion_read_RDY_PIN
 功能描述: 读取指定轴的伺服准备好端口的电平
 输　  入: axis     轴号
 返 回 值: 0-低电平, 1-高电平, -1-无效值,该板卡不支持RDY
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_read_RDY_PIN(_WORD axis);

/********************************************************************************
 *******************************    通用IO读写    *******************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_read_inbit
 功能描述: 读取通用输入端口信号
 输　  入: cardno 卡号
           bitno  端口号,取值范围:B6612(1~16)、S8250(1~26)、B6308(1~16)、S8440(1~20)
 返 回 值: 0-低电平, 1-高电平
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_read_inbit(_WORD cardno, _WORD bitno);

/********************************************************************************
 函数名称: motion_write_outbit
 功能描述: 写通用输出信号
 输　  入: cardno 卡号
           bitno  端口号,取值范围:B6612(1~28)、S8250(1~28)、B6308(1~24)、S8440(1~20)
           on_off 0-低电平, 1-高电平
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_write_outbit(_WORD cardno, _WORD bitno, _WORD on_off);

/********************************************************************************
 函数名称: motion_read_outbit
 功能描述: 读取通用输出信号
 输　  入: cardno 卡号
           bitno  端口号,取值范围:B6612(1~28)、S8250(1~28)、B6308(1~24)、S8440(1~20)
 返 回 值: 0-低电平, 1-高电平
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_read_outbit(_WORD cardno, _WORD bitno) ;

/********************************************************************************
 函数名称: motion_read_inport
 功能描述: 读取指定控制卡的全部通用输入口的电平状态
 输　  入: cardno 卡号
 返 回 值: bit0～bit(N-1)位值分别代表第1～N号输入端口值,N取值范围：
           B6612(1~16)、S8250(1~26)、B6308(1~16)、S8440(1~20)
           0-低电平, 1-高电平
*********************************************************************************/
MOTION_API _LONG MOTION_CDECL motion_read_inport(_WORD cardno);

/********************************************************************************
 函数名称: motion_read_outport
 功能描述: 读取指定控制卡的全部通用输出口的电平状态
 输　  入: cardno 卡号
 返 回 值: bit0～bit(N-1)位值分别代表第1～N号输出端口值,N取值范围：
           B6612(1~28)、S8250(1~28)、B6308(1~24)、S8440(1~20)
           0-低电平, 1-高电平
*********************************************************************************/
MOTION_API _LONG MOTION_CDECL motion_read_outport(_WORD cardno);

/********************************************************************************
 函数名称: motion_write_outport
 功能描述: 指定控制卡的全部通用输出口的电平状态
 输　  入: cardno      卡号
           port_value  bit0～bit(N-1)位值分别代表第1～N号输出端口值,N取值范围：
                       B6612(1~28)、S8250(1~28)、B6308(1~24)、S8440(1~20)
                       0-低电平, 1-高电平
 返 回 值:            
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_write_outport(_WORD cardno, _DWORD port_value);

/********************************************************************************
 ********************************    状态检测    ********************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_check_done
 功能描述: 读取轴运动状态
 输　  入: axis 轴号
 返 回 值: 0:运动 1:停止
*********************************************************************************/
MOTION_API _WORD MOTION_CDECL  motion_check_done(_WORD axis) ;

/********************************************************************************
 函数名称: motion_axis_io_status
 功能描述: 读取轴专用输入信号
 输　  入: axis 轴号
 返 回 值: 目前仅以下信号有效
           8-正在加速   9-正在减速  10-正在匀速运行
           12-EL+       13-EL_      14-ORG
           相应位: 0表示信号无效,1表示信号有效
*********************************************************************************/
MOTION_API _WORD MOTION_CDECL motion_axis_io_status(_WORD axis);

/********************************************************************************
 函数名称: motion_get_rsts
 功能描述: 读取轴外部信号
 输　  入: axis     轴号
 返 回 值: 目前仅以下信号有效
            7-EMG紧急停止信号
           15-INP到位信号
           相应位: 0表示信号无效,1表示信号有效
*********************************************************************************/
MOTION_API _DWORD MOTION_CDECL motion_get_rsts(_WORD axis);

/********************************************************************************
功  能：读取指定轴的专用接口信号电平,S系列专用
参  数：axis：轴号
返回值：BIT位:0-ORG, 1-SD, 2-EL+,  3-EL-,    4-ALM, 5-INP, 6-RDY,
              7-板级EMG,   9-CMP, 10-SEVON, 11-ERC, 其它位保留
        0表示低电平,1表示高电平
*********************************************************************************/
MOTION_API _DWORD MOTION_CDECL motion_get_sig(_WORD axis);

/********************************************************************************
功  能：读取指定轴的专用接口信号电平,B系列专用
参  数：axis：轴号
返回值：BIT位:0-EL-, 1-EL+, 2-ORG, 5-SD-, 6-SD+,其它位保留
        0表示低电平,1表示高电平
*********************************************************************************/
MOTION_API _DWORD MOTION_CDECL motion_get_status(_WORD axis);


/********************************************************************************
 ******************************    设置速度参数    ******************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_set_profile
 功能描述: 设置轴梯形运动曲线
 输　  入: axis     轴号
           Min_Vel  起始速度，单位pps 
           Max_Vel  运行速度，单位pps 
           Tacc     总加速时间，单位s 
           Tdec     总减速时间，单位s 
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_profile(_WORD axis, _DOUBLE Min_Vel, _DOUBLE Max_Vel,
                                             _DOUBLE Tacc, _DOUBLE Tdec);

/********************************************************************************
 函数名称: motion_set_st_profile
 功能描述: 设置S形速度曲线(按S段时间)
 输　  入: axis     轴号
           Min_Vel  起始速度，单位pps 
           Max_Vel  运行速度，单位pps 
           Tacc     总加速时间，单位s 
           Tdec     总减速时间，单位s 
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_st_profile(_WORD axis, _DOUBLE Min_Vel, _DOUBLE Max_Vel,
                                                _DOUBLE Tacc, _DOUBLE Tdec, _DOUBLE Tsacc, _DOUBLE Tsdec);

/********************************************************************************
 函数名称: motion_set_vector_profile
 功能描述: 设置多轴插补运动的矢量速度曲线
 输　  入: Min_Vel  起始速度，单位pps 
           Max_Vel  运行速度，单位pps 
           Tacc     总加速时间，单位s 
           Tdec     总减速时间，单位s 
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_vector_profile(_DOUBLE Min_Vel, _DOUBLE Max_Vel, _DOUBLE Tacc, _DOUBLE Tdec);

/********************************************************************************
 函数名称: motion_set_st_vector_profile
 功能描述: 设置多轴插补运动的S形加速(按S段时间)矢量速度曲线
 输　  入: Min_Vel  起始速度，单位pps 
           Max_Vel  运行速度，单位pps 
           Tacc     总加速时间，单位s 
           STacc    S段加速时间，单位s 
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_st_vector_profile(_DOUBLE Min_Vel, _DOUBLE Max_Vel, _DOUBLE Tacc, _DOUBLE STacc);

/********************************************************************************
 函数名称: motion_change_speed
 功能描述: 在线改变指定轴的当前运动速度
 输　  入: axis       轴号 
           Curr_Vel   新的运行速度，单位pps
           暂时不支持此功能
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_change_speed(_WORD axis, _DOUBLE Curr_Vel);


/********************************************************************************
 *****************************    运动与制动控制    *****************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_t_pmove
 功能描述: 单轴梯形定长运动(对称的T形加减速)
 输　  入: axis      轴号
           Dist      位移
           posi_mode 0-相对位移,1-绝对位移
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_t_pmove(_WORD axis,_LONG Dist,_WORD posi_mode);

/********************************************************************************
 函数名称: motion_s_pmove
 功能描述: 单轴S形定长运动(对称的S形加减速)
 输　  入: axis      轴号
           Dist      位移
           posi_mode 0-相对位移,1-绝对位移
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_s_pmove(_WORD axis, _LONG Dist, _WORD posi_mode);

/********************************************************************************
 函数名称: motion_t_vmove
 功能描述: 单轴梯形加速连续运动
 输　  入: axis      轴号
           dir       0-负方向,1-正方向
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_t_vmove(_WORD axis, _WORD dir);

/********************************************************************************
 函数名称: motion_s_vmove
 功能描述: 单轴S形加速连续运动
 输　  入: axis      轴号
           dir       0-负方向,1-正方向
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_s_vmove(_WORD axis, _WORD dir);

/********************************************************************************
 函数名称: motion_t_line2
 功能描述: 任意2轴以对称的梯形加减速作直线插补
 输　  入: axis1     指定两轴插补的第一轴 
           axis2     指定两轴插补的第二轴 
           Dist1     指定axis1的位移值，单位：脉冲数 
           Dist2     指定axis2的位移值，单位：脉冲数 
           posi_mode  位移模式设定：0表示相对位移，1表示绝对位移
           当 posi_mode=0 时，作相对位移运动，运动方向由Dist的正负值确定；
           为posi_mode=1，作绝对位移运动，运动方向由Dist与当前位置的差值决定
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_t_line2(_WORD axis1, _LONG Dist1, _WORD axis2, _LONG Dist2, _WORD posi_mode);

/********************************************************************************
 函数名称: motion_t_line3
 功能描述: 任意3轴以对称的梯形加减速作直线插补
 输　  入: axis     轴号列表的指针 
           Dist1    指定插补轴1的位移值，单位：脉冲数 
           Dist2    指定插补轴2的位移值，单位：脉冲数 
           Dist3    指定插补轴3的位移值，单位：脉冲数 
           posi_mode  位移模式设定：0表示相对位移，1表示绝对位移
           当 posi_mode=0 时，作相对位移运动，运动方向由Dist的正负值确定；
           为posi_mode=1，作绝对位移运动，运动方向由Dist与当前位置的差值决定
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_t_line3(_WORD *axis, _LONG Dist1, _LONG Dist2, _LONG Dist3, _WORD posi_mode);

/********************************************************************************
 函数名称: motion_t_line4
 功能描述: 4轴(0-3轴)以对称的梯形加减速作直线插补
 输　  入: cardno   卡号
           Dist1    指定插补轴1的位移值，单位：脉冲数 
           Dist2    指定插补轴2的位移值，单位：脉冲数 
           Dist3    指定插补轴3的位移值，单位：脉冲数 
           Dist4    指定插补轴4的位移值，单位：脉冲数 
           posi_mode  位移模式设定：0表示相对位移，1表示绝对位移
           当 posi_mode=0 时，作相对位移运动，运动方向由Dist的正负值确定；
           为posi_mode=1，作绝对位移运动，运动方向由Dist与当前位置的差值决定
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_t_line4(_WORD cardno, _LONG Dist1, _LONG Dist2, _LONG Dist3, _LONG Dist4, _WORD posi_mode);

/********************************************************************************
 函数名称: motion_line
 功能描述: 同卡内任意轴直线插补
 输　  入: axisnum      轴数
           axis         轴号列表
           dist         位移列表
           posi_mode    位移模式
           当posi_mode=0,作相对位移运动,运动方向由Dist的正负值确定
             posi_mode=1,作绝对位移运动,运动方向由Dist与当前位置的差值决定
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_line(_WORD axisnum, _WORD *axis, _LONG *dist, _WORD posi_mode);

/********************************************************************************
函数名称: motion_arc_move
功    能：任意两轴以当前位置为起点，按指定的圆心、目标绝对位置和方向作圆弧插补运动 
参    数：axis        轴号列表指针
          target_pos  目标绝对位置列表指针，坐标单位：脉冲数 
          cen_pos     圆心绝对位置列表指针，坐标单位：脉冲数 
          arc_dir     圆弧方向：0表示顺时针，1表示逆时针 
返 回 值：无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_arc_move(_WORD *axis, _LONG *target_pos, _LONG *cen_pos, _WORD arc_dir);

/********************************************************************************
函数名称: motion_rel_arc_move
功    能：任意两轴以当前位置为起点，按指定的圆心、目标相对位置和方向作圆弧插补运动 
参    数：axis        轴号列表指针 
          rel_pos     目标相对位置列表指针, 单位：脉冲数 
          cen_pos     圆心相对位置列表指针, 单位：脉冲数 
          arc_dir     圆弧方向：0表示顺时针，1表示逆时针 
返 回 值：无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_rel_arc_move(_WORD *axis, _LONG *rel_pos, _LONG *rel_cen, _WORD arc_dir);

/********************************************************************************
 函数名称: motion_decel_stop
 功能描述: 减速停止
 输　  入: axis      轴号
           Tdec      减速时间，单位s
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_decel_stop(_WORD axis, _DOUBLE Tdec);

/********************************************************************************
 函数名称: motion_imd_stop
 功能描述: 立即停止
 输　  入: axis     轴号
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_imd_stop(_WORD axis);

/********************************************************************************
 函数名称: motion_emg_stop
 功能描述: 紧急停止所有轴.暂时不支持该功能
 输　  入: 
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_emg_stop(_VOID);

/********************************************************************************
 函数名称: motion_get_position
 功能描述: 读取当前速度值，单位pps
 输　  入: axis  轴号
 返 回 值: 指定轴的速度脉冲数
*********************************************************************************/
MOTION_API _DOUBLE MOTION_CDECL motion_read_current_speed(_WORD axis);

/********************************************************************************
 *****************************    位置设置与读取    *****************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_get_position
 功能描述: 读取指令脉冲位置
 输　  入: axis   轴号
 返 回 值: 位移
*********************************************************************************/
MOTION_API _LONG MOTION_CDECL motion_get_position(_WORD axis);

/********************************************************************************
 函数名称: motion_set_position
 功能描述: 设置指令脉冲位置
 输　  入: axis             轴号
           current_position 位移
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_position(_WORD axis, _LONG current_position);

/********************************************************************************
 *******************************    回原点模式    *******************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_config_home_mode
 功能描述: 回原点信号模式
 输　  入: axis     轴号
           mode     0-只计home, 1-home和EZ,目前只支持0
           EZ_count 仅mode为1时有效,取值1-16
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_home_mode(_WORD axis, _WORD mode, _WORD EZ_count);

/********************************************************************************
 函数名称: motion_home_move
 功能描述: 回原点命令,检测到原点信号后会自动停止运动
 输　  入: axis       轴号
           home_mode  1-正方向回原点,2-负方向回原点
           vel_mode   0-低速回原点,1-高速回原点
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_home_move(_WORD axis, _WORD home_mode, _WORD vel_mode);


/********************************************************************************
 *******************************    编码器配置    *******************************
 ********************************************************************************/
/********************************************************************************
 函数名称: motion_counter_config
 功能描述: 编码器输入方式的设置
 输　  入: axis 轴号
           mode 0-脉冲+方向
                1-1倍AB相脉冲
                2-2倍AB相脉冲
                3-4倍AB相脉冲
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_counter_config(_WORD axis, _WORD mode);

/********************************************************************************
 函数名称: motion_get_encoder
 功能描述: 读取编码器反馈位置脉冲计数值
 输　  入: axis     轴号
 返 回 值: 编码器反馈脉冲，单位pps
*********************************************************************************/
MOTION_API _LONG MOTION_CDECL motion_get_encoder(_WORD axis);

/********************************************************************************
 函数名称: motion_set_encoder
 功能描述: 设置编码器反馈位置脉冲计数值
 输　  入: axis             轴号
           encoder_value    编码器反馈脉冲计数位移
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_set_encoder(_WORD axis, _LONG encoder_value);

/********************************************************************************
 函数名称: motion_config_latch_mode
 功能描述: 设置锁存方式为单轴锁存或是四轴同时锁存.暂时不支持该功能
 输　  入: cardno       卡号
           all_enable   锁存方式
                        0－单独锁存
                        1－四轴同时锁存
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_config_latch_mode(_WORD cardno, _WORD all_enable);

/********************************************************************************
 函数名称: motion_triger_chunnel
 功能描述: 选择全部锁存时外触发信号的通道.暂时不支持该功能
           可以由二个信号通道输入,端子LTC1或者LTC2；默认为LTC1
 输　  入: cardno   卡号
           Num      信号通道选择： 
                    1－ 通过端子LTC1锁存四个轴
                    2－ 通过端子LTC2锁存四个轴 
 返 回 值: 
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_triger_chunnel(_WORD cardno, _WORD num);

/********************************************************************************
 函数名称: motion_get_latch_value
 功能描述: 读取编码器锁存器的值.暂时不支持该功能
 输　  入: axis 轴号
 返 回 值: 锁存器内的编码器脉冲数，单位：脉冲
*********************************************************************************/
MOTION_API _LONG MOTION_CDECL motion_get_latch_value(_WORD axis);

/********************************************************************************
 函数名称: motion_set_t_move_all
 功能描述: 设置多卡同步运动参数
 输　  入: TotalAxes   同步运动轴的数量  
           pAxis       轴号列表指针 
           pDist       距离列表指针,单位:脉冲数
           posi_mode   位置模式:0表示相对位置,1表示绝对位置 
 返 回 值: 1表示正常,-1表示参数错
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_set_t_move_all(_WORD TotalAxes, _WORD *pAxis, _LONG *pDist, _WORD posi_mode);

/********************************************************************************
 函数名称: motion_start_move_all
 功能描述: 启动多卡同步运动
 输　  入: FirstAxis   第一轴轴号
 返 回 值: 1表示正常,-1表示参数错
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_start_move_all(_WORD FirstAxis);

/********************************************************************************
 函数名称: motion_simultaneous_stop
 功能描述: 向指定轴所在卡的CSTP端口输出停止脉冲
 输　  入: axis   轴号
 返 回 值: 无
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_simultaneous_stop(_WORD axis);

/********************************************************************************
 函数名称: motion_set_sync_option
 功能描述: 设置多卡同步信号参数
 输　  入: axis             轴号
           sync_stop_on     CSTP信号有效时(低电平变高电平),轴是否停止,0-不停止(默认),1-停止
           cstop_output_on  异常停止时是否输出CSTP信号,0-不输出(默认),1-输出,(暂不支持该参数)
           sync_option1     是否等待CSTA后启动该功能,0-不等待立即启动(默认),1-等待,(暂不支持该参数)
           sync_option2     保留
 返 回 值: 1表示正常,-1表示参数错
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_set_sync_option(_WORD axis, _WORD sync_stop_on, _WORD cstop_output_on, _WORD sync_option1, _WORD sync_option2);

/********************************************************************************
 函数名称: motion_set_sync_stop_mode
 功能描述: 设置多卡同步停止模式
 输　  入: axis         轴号
           stop_mode    停止模式:0-立即停止(默认),1-减速停止
 返 回 值: 1表示正常,-1表示参数错
*********************************************************************************/
MOTION_API _INT MOTION_CDECL motion_set_sync_stop_mode(_WORD axis, _WORD stop_mode);

/********************************************************************************
 函数名称: motion_simultaneous_disable
 功能描述: 去使能指定轴多卡同步功能,相关参数恢复默认值
 输　  入: axis   轴号
 返 回 值: 无
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL motion_simultaneous_disable(_WORD axis);

#ifdef SUPPORT_SPI

/********************************************************************************
 函数名称: motion_GenerateSquareWave
 功能描述: 在指定输出端口生成指定时长方波
 输　  入: cardno: 卡号0-3
           bitno: 1-32(实际只支持31-32)
           delayuss: 方波持续时长(单位:微秒)
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_GenerateSquareWave(_WORD cardno, _WORD bitno, _DWORD delayuss);

/********************************************************************************
 函数名称: motion_DAC
 功能描述: 在指定DAC通道输出电压
 输　  入: cardno: 卡号0-3
           channelno: 1-2
           value: 电压值0-4095，max=10V
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DAC(_WORD cardno, _WORD channelno, _WORD value);

/********************************************************************************
 函数名称: motion_DTC_SCF
 功能描述: 
 输　  入: 
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DTC_SCF(_WORD cardno, ST_DETECT_CONFIG *detectConfig);

/********************************************************************************
 函数名称: motion_DTC_GCF
 功能描述: 
 输　  入: 
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DTC_GCF(_WORD cardno, ST_DETECT_CONFIG *detectConfig);

/********************************************************************************
 函数名称: motion_DTC_PHO1
 功能描述: 
 输　  入: 
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DTC_PHO1(_WORD cardno, _WORD num, _WORD exposureUss, ST_POSITION *position );

/********************************************************************************
 函数名称: motion_DTC_FOV1
 功能描述: 
 输　  入: 
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DTC_FOV1(_WORD cardno, _WORD detectTransactionId, _WORD totalNum, _WORD no, _WORD num, ST_POSITION *position );

/********************************************************************************
 函数名称: motion_DTC_START
 功能描述: 
 输　  入: 
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DTC_START(_WORD cardno, _WORD detectTransactionId);

/********************************************************************************
 函数名称: motion_DTC_STOP
 功能描述: 
 输　  入: 
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DTC_STOP(_WORD cardno, _WORD detectTransactionId);

/********************************************************************************
 函数名称: motion_DTC_PAUSE
 功能描述: 
 输　  入: 
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DTC_PAUSE(_WORD cardno, _WORD detectTransactionId);

/********************************************************************************
 函数名称: motion_DTC_STATE
 功能描述: 
 输　  入: 
 返 回 值: 无 
*********************************************************************************/
MOTION_API _VOID motion_DTC_STATE(_WORD cardno, _WORD detectTransactionId, _WORD *fovNo, _UCHAR *stepNo, _UCHAR *photoDetect, _UCHAR *state, _UCHAR *isPause);

#endif

#ifdef SUPPORT_SAFE

/********************************************************************************
 函数名称: safe_board_init
 功能描述: 加密板初始化(串口)
 输　  入: 无
 返 回 值: 0：无卡； 1：成功
*********************************************************************************/
typedef _VOID (* PFN_SAFERECVPKT)( _UCHAR *pbPacket, _WORD wPacketLen );
MOTION_API _WORD MOTION_CDECL safe_board_init(_CHAR *pcCOM, PFN_SAFERECVPKT pfnRecvPkt);

/********************************************************************************
 函数名称: safe_board_close
 功能描述: 关闭加密板
 输　  入: 无
 返 回 值: 无
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL safe_board_close(_VOID);

/********************************************************************************
 函数名称: safe_send_data
 功能描述: 发送数据到加密板
 输　  入: 无
 返 回 值: 无
*********************************************************************************/
MOTION_API _WORD MOTION_CDECL safe_send_data( _UCHAR *pbPacket, _WORD wPacketLen );

/********************************************************************************
 函数名称: safe_board_recv
 功能描述: 加密板接收数据
 输　  入: 无
 返 回 值: 无
*********************************************************************************/
MOTION_API _VOID MOTION_CDECL safe_board_recv( _VOID );

#endif

/********************************************************************************
 函数名称: motion_PRN_SET
 功能描述: 重定向打印输出
 输　  入: 
 返 回 值: 
*********************************************************************************/
typedef _VOID  (*PFN_Print)( _CHAR *pcString );
MOTION_API _VOID MOTION_CDECL motion_PRN_SET(PFN_Print pfnPrint);

#ifdef __cplusplus
}
#endif

#endif

